**free
///
// Bonjour le Monde !
// Un petit programme exemple pour tester Code For IBMi!
// Description can be multiline
// @tag data
// @tag data
///  
/copy '../qrpgleref/copytest.rpgle'
/copy '/home/NOVY400/include/TAG1.rpgle'
dcl-s gMsg char(25);

gMsg = 'Bonjour Carquefou';

dsply gMsg;

return;