**free
///
// Bonjour le Monde !
// Un petit programme exemple pour tester Code For IBMi!
// Description can be multiline
// @tag data
// @tag data
///  
dcl-s gMsg char(25);

gMsg = 'Bonjour Carquefou';

dsply gMsg;

return;